## Plan Result (prod_enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 75 to add, 141 to change, 75 to destroy.</code></pre>

* Update
  * module.environment[&#34;demo&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;dev&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;ithc&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;prod&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;ptl&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;ptlsbox&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;sbox&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;stg&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;test&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CNP-QA&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-RDO-Development&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-DATAINGEST-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-DATAINGEST-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-DATAINGEST-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-DATAINGEST-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-DATAINGEST-STG&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-DATAINGEST-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_secret.sp_token
* Replace
  * module.environment[&#34;demo&#34;].azuread_application_password.token
  * module.environment[&#34;dev&#34;].azuread_application_password.token
  * module.environment[&#34;ithc&#34;].azuread_application_password.token
  * module.environment[&#34;prod&#34;].azuread_application_password.token
  * module.environment[&#34;ptl&#34;].azuread_application_password.token
  * module.environment[&#34;ptlsbox&#34;].azuread_application_password.token
  * module.environment[&#34;sbox&#34;].azuread_application_password.token
  * module.environment[&#34;stg&#34;].azuread_application_password.token
  * module.environment[&#34;test&#34;].azuread_application_password.token
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CNP-QA&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-RDO-Development&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-DATAINGEST-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-DATAINGEST-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-DATAINGEST-STG&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_application_password.token
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_application_password.token
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_application_password.token
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_application_password.token
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_application_password.token




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.environment["demo"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/fcc63c4d-d347-4e4f-b32e-81643079b27d" -> (known after apply)
      ~ application_object_id = "fcc63c4d-d347-4e4f-b32e-81643079b27d" -> "/applications/fcc63c4d-d347-4e4f-b32e-81643079b27d" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-10-06T07:05:47Z" -> (known after apply)
      ~ id                    = "fcc63c4d-d347-4e4f-b32e-81643079b27d/password/08bb593e-ddcc-4aeb-9ba1-16f26dd6a873" -> (known after apply)
      ~ key_id                = "08bb593e-ddcc-4aeb-9ba1-16f26dd6a873" -> (known after apply)
      ~ start_date            = "2023-10-06T07:05:47Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["demo"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "08221f14-fdee-45ea-8c95-846ec325b992"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["dev"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/5f463690-f80e-4284-bb35-0b7c2cd014c3" -> (known after apply)
      ~ application_object_id = "5f463690-f80e-4284-bb35-0b7c2cd014c3" -> "/applications/5f463690-f80e-4284-bb35-0b7c2cd014c3" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-10-06T07:05:47Z" -> (known after apply)
      ~ id                    = "5f463690-f80e-4284-bb35-0b7c2cd014c3/password/47e055ed-6314-487f-a603-f72950596308" -> (known after apply)
      ~ key_id                = "47e055ed-6314-487f-a603-f72950596308" -> (known after apply)
      ~ start_date            = "2023-10-06T07:05:47Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["dev"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "73cabb79-5119-490a-b589-cfd227539ca5"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["ithc"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/cae18304-2c43-46af-86e8-926702c344b4" -> (known after apply)
      ~ application_object_id = "cae18304-2c43-46af-86e8-926702c344b4" -> "/applications/cae18304-2c43-46af-86e8-926702c344b4" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-10-06T07:05:47Z" -> (known after apply)
      ~ id                    = "cae18304-2c43-46af-86e8-926702c344b4/password/5061e682-08a1-41d2-9c5c-5c3562ab680b" -> (known after apply)
      ~ key_id                = "5061e682-08a1-41d2-9c5c-5c3562ab680b" -> (known after apply)
      ~ start_date            = "2023-10-06T07:05:47Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["ithc"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "a2bfb279-4595-4969-9f77-b729bd45bf0f"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["prod"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/9c149b18-7537-4b03-9093-641191faee0b" -> (known after apply)
      ~ application_object_id = "9c149b18-7537-4b03-9093-641191faee0b" -> "/applications/9c149b18-7537-4b03-9093-641191faee0b" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-10-06T07:05:47Z" -> (known after apply)
      ~ id                    = "9c149b18-7537-4b03-9093-641191faee0b/password/f502019e-2ab9-449a-bc8b-3462a3775afe" -> (known after apply)
      ~ key_id                = "f502019e-2ab9-449a-bc8b-3462a3775afe" -> (known after apply)
      ~ start_date            = "2023-10-06T07:05:47Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["prod"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "1a18e2d8-b36f-40e7-872b-6045dd48be30"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["ptl"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/d4eb8008-5914-47d3-a21a-fd89f4c50b36" -> (known after apply)
      ~ application_object_id = "d4eb8008-5914-47d3-a21a-fd89f4c50b36" -> "/applications/d4eb8008-5914-47d3-a21a-fd89f4c50b36" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-10-06T07:05:47Z" -> (known after apply)
      ~ id                    = "d4eb8008-5914-47d3-a21a-fd89f4c50b36/password/657beaab-c768-44d4-9596-ee24e04219b1" -> (known after apply)
      ~ key_id                = "657beaab-c768-44d4-9596-ee24e04219b1" -> (known after apply)
      ~ start_date            = "2023-10-06T07:05:47Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["ptl"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "03bb29ba-af78-4fb2-9e23-1eca3afb3b6e"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["ptlsbox"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/3fdcf12a-6a2c-46fc-be16-71510f849748" -> (known after apply)
      ~ application_object_id = "3fdcf12a-6a2c-46fc-be16-71510f849748" -> "/applications/3fdcf12a-6a2c-46fc-be16-71510f849748" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-10-06T07:05:47Z" -> (known after apply)
      ~ id                    = "3fdcf12a-6a2c-46fc-be16-71510f849748/password/f6b6b38a-8eaf-4945-8ebc-4ad9d375997d" -> (known after apply)
      ~ key_id                = "f6b6b38a-8eaf-4945-8ebc-4ad9d375997d" -> (known after apply)
      ~ start_date            = "2023-10-06T07:05:47Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["ptlsbox"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "b13822df-6271-4119-947a-174055ca8c0a"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["sbox"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/acc21fed-cca3-4b72-ae8a-73bac29b976e" -> (known after apply)
      ~ application_object_id = "acc21fed-cca3-4b72-ae8a-73bac29b976e" -> "/applications/acc21fed-cca3-4b72-ae8a-73bac29b976e" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-10-06T07:05:47Z" -> (known after apply)
      ~ id                    = "acc21fed-cca3-4b72-ae8a-73bac29b976e/password/44d95324-d48d-438e-a19f-98a2976c1d53" -> (known after apply)
      ~ key_id                = "44d95324-d48d-438e-a19f-98a2976c1d53" -> (known after apply)
      ~ start_date            = "2023-10-06T07:05:47Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["sbox"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "e006bad5-f598-4230-9d83-c4c0ba5314f8"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["stg"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/0765b073-cc02-4287-ba01-4a8dff3e1a93" -> (known after apply)
      ~ application_object_id = "0765b073-cc02-4287-ba01-4a8dff3e1a93" -> "/applications/0765b073-cc02-4287-ba01-4a8dff3e1a93" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-10-06T07:05:47Z" -> (known after apply)
      ~ id                    = "0765b073-cc02-4287-ba01-4a8dff3e1a93/password/94504a9b-58f6-40ee-982b-177b07d0678d" -> (known after apply)
      ~ key_id                = "94504a9b-58f6-40ee-982b-177b07d0678d" -> (known after apply)
      ~ start_date            = "2023-10-06T07:05:47Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["stg"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "3b5f78c8-1728-47aa-890f-2f251c34d7eb"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.environment["test"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/90950051-fbb1-40e5-aede-b661a736c1ef" -> (known after apply)
      ~ application_object_id = "90950051-fbb1-40e5-aede-b661a736c1ef" -> "/applications/90950051-fbb1-40e5-aede-b661a736c1ef" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-10-06T07:05:47Z" -> (known after apply)
      ~ id                    = "90950051-fbb1-40e5-aede-b661a736c1ef/password/649460e3-cee0-4ce7-9133-8fb5e8aa07b9" -> (known after apply)
      ~ key_id                = "649460e3-cee0-4ce7-9133-8fb5e8aa07b9" -> (known after apply)
      ~ start_date            = "2023-10-06T07:05:47Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["test"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "16857e89-9ec3-437b-a7e6-d8aac8839122"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["CRIME-ADO-POC"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/deb6a299-036c-4dd9-acb0-4cc63723e118" -> (known after apply)
      ~ application_object_id = "deb6a299-036c-4dd9-acb0-4cc63723e118" -> "/applications/deb6a299-036c-4dd9-acb0-4cc63723e118" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-08-14T07:07:02Z" -> (known after apply)
      ~ id                    = "deb6a299-036c-4dd9-acb0-4cc63723e118/password/b368f2b7-972b-4a45-8b5e-e15036134122" -> (known after apply)
      ~ key_id                = "b368f2b7-972b-4a45-8b5e-e15036134122" -> (known after apply)
      ~ start_date            = "2023-08-14T07:07:02Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "a0b9d7e8-87f0-48ba-b5ba-55c927cbcb4c"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/sp-token/2a5b931378e0488d81c9c7946e25ddcb"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-AWS-Migration"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/f4c47bf2-662c-40fc-838e-afc49f206773" -> (known after apply)
      ~ application_object_id = "f4c47bf2-662c-40fc-838e-afc49f206773" -> "/applications/f4c47bf2-662c-40fc-838e-afc49f206773" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-25T07:09:52Z" -> (known after apply)
      ~ id                    = "f4c47bf2-662c-40fc-838e-afc49f206773/password/0fcc6cee-ec51-4f4a-8f05-6ee5590d2798" -> (known after apply)
      ~ key_id                = "0fcc6cee-ec51-4f4a-8f05-6ee5590d2798" -> (known after apply)
      ~ start_date            = "2023-07-25T07:09:52Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DCD-AWS-Migration"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "83d332b8-5155-4f6e-8a0c-69fad816c9a6"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c58a2ce36d164aa559c68kv.vault.azure.net/secrets/sp-token/d97f16bd4d0c444dbacac4e1bad67d2a"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFT-Sandbox"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/d14f75f0-be54-403c-a1e1-7172637a3ae1" -> (known after apply)
      ~ application_object_id = "d14f75f0-be54-403c-a1e1-7172637a3ae1" -> "/applications/d14f75f0-be54-403c-a1e1-7172637a3ae1" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-25T07:10:07Z" -> (known after apply)
      ~ id                    = "d14f75f0-be54-403c-a1e1-7172637a3ae1/password/f1ff011c-6fb1-4552-a82a-50e4f0d751eb" -> (known after apply)
      ~ key_id                = "f1ff011c-6fb1-4552-a82a-50e4f0d751eb" -> (known after apply)
      ~ start_date            = "2023-07-25T07:10:07Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DCD-CFT-Sandbox"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "74cc4aa7-10b7-40b9-9788-2e1eb057d236"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DCD-CFT-Sandbox"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://cbf308a5c8dca9fd43783kv.vault.azure.net/secrets/sp-token/dc07f24fabd34d46b2a22f7bacc894e0"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/063526e9-da78-4d26-92d5-ce34293769c0" -> (known after apply)
      ~ application_object_id = "063526e9-da78-4d26-92d5-ce34293769c0" -> "/applications/063526e9-da78-4d26-92d5-ce34293769c0" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-25T07:09:42Z" -> (known after apply)
      ~ id                    = "063526e9-da78-4d26-92d5-ce34293769c0/password/85280c8c-c87c-4b22-a8fb-28c6d7837c7a" -> (known after apply)
      ~ key_id                = "85280c8c-c87c-4b22-a8fb-28c6d7837c7a" -> (known after apply)
      ~ start_date            = "2023-07-25T07:09:42Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "cb452835-a0a7-4f68-847b-0a2600627143"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c4bb049c89ee45375cc18kv.vault.azure.net/secrets/sp-token/48c4f2d7da054db19c20ebf0214684ce"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DCD-CFTAPPS-DEMO"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "f7e67b96-e647-49fa-9471-f2babb6d0cff"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c2307d175515529b845f2kv.vault.azure.net/secrets/sp-token/db0ea2f484ab4da5875ecb40dfbbd2fc"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["MOJ DCD Atlassian LVE"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/12784a53-6921-49b4-b423-226359eac604" -> (known after apply)
      ~ application_object_id = "12784a53-6921-49b4-b423-226359eac604" -> "/applications/12784a53-6921-49b4-b423-226359eac604" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-08-11T07:06:43Z" -> (known after apply)
      ~ id                    = "12784a53-6921-49b4-b423-226359eac604/password/fd74aee2-037d-401f-9b92-e9766852a285" -> (known after apply)
      ~ key_id                = "fd74aee2-037d-401f-9b92-e9766852a285" -> (known after apply)
      ~ start_date            = "2023-08-11T07:06:43Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MOJ DCD Atlassian LVE"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "af067f35-31fc-4fe9-a5ec-73216331f258"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["MOJ DCD Atlassian LVE"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c7989889753c764839d95kv.vault.azure.net/secrets/sp-token/cd66207bd911402f91e325eec3ce8cd4"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["MOJ DCD Atlassian NLE"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/689d247b-3558-4c62-ac72-a834bd3208a5" -> (known after apply)
      ~ application_object_id = "689d247b-3558-4c62-ac72-a834bd3208a5" -> "/applications/689d247b-3558-4c62-ac72-a834bd3208a5" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-08-14T07:07:02Z" -> (known after apply)
      ~ id                    = "689d247b-3558-4c62-ac72-a834bd3208a5/password/c62cf2ca-3453-4b9e-8e6c-672256f066fe" -> (known after apply)
      ~ key_id                = "c62cf2ca-3453-4b9e-8e6c-672256f066fe" -> (known after apply)
      ~ start_date            = "2023-08-14T07:07:02Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MOJ DCD Atlassian NLE"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "93702e8f-2062-43a4-b851-8e04e6442f5c"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["MOJ DCD Atlassian NLE"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://cb7d2bd5fe068cec2e8d8kv.vault.azure.net/secrets/sp-token/85fc11276195443ba903ed38db00c107"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["MoJ Common Platform Non-Live Management"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/215927f5-a61b-4721-b03d-5291b009544a" -> (known after apply)
      ~ application_object_id = "215927f5-a61b-4721-b03d-5291b009544a" -> "/applications/215927f5-a61b-4721-b03d-5291b009544a" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-08-14T07:07:02Z" -> (known after apply)
      ~ id                    = "215927f5-a61b-4721-b03d-5291b009544a/password/3e58d2dc-b075-4a1e-95a3-2e9fbc3dbc3e" -> (known after apply)
      ~ key_id                = "3e58d2dc-b075-4a1e-95a3-2e9fbc3dbc3e" -> (known after apply)
      ~ start_date            = "2023-08-14T07:07:02Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Common Platform Non-Live Management"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "031c971f-0c31-44f7-a080-97db8e8160d2"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["MoJ Common Platform Non-Live Management"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c66cfcc0b0a74101dbcf3kv.vault.azure.net/secrets/sp-token/2547a534bbb54760a0486e8b8493cc5a"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["MoJ Common Platform Operational Services"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/97983fff-b312-4973-b0b6-748d705db678" -> (known after apply)
      ~ application_object_id = "97983fff-b312-4973-b0b6-748d705db678" -> "/applications/97983fff-b312-4973-b0b6-748d705db678" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-10-19T07:06:10Z" -> (known after apply)
      ~ id                    = "97983fff-b312-4973-b0b6-748d705db678/password/3476d17c-166c-4915-a4fa-4a8db89971f5" -> (known after apply)
      ~ key_id                = "3476d17c-166c-4915-a4fa-4a8db89971f5" -> (known after apply)
      ~ start_date            = "2023-10-19T07:06:10Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Common Platform Operational Services"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "a29ac3d8-c8d9-4bb4-9a56-f05d78cffd2c"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["MoJ Common Platform Operational Services"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c28d33a47ce9c9b5a3937kv.vault.azure.net/secrets/sp-token/6cb44b52ccc54e01aed3a3e7aad289d5"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pre-Production"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/6466b883-b713-4329-b380-4fff0a91094a" -> (known after apply)
      ~ application_object_id = "6466b883-b713-4329-b380-4fff0a91094a" -> "/applications/6466b883-b713-4329-b380-4fff0a91094a" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-10-19T07:06:10Z" -> (known after apply)
      ~ id                    = "6466b883-b713-4329-b380-4fff0a91094a/password/cbfd3762-5368-41fb-81a0-9a62afc21cb0" -> (known after apply)
      ~ key_id                = "cbfd3762-5368-41fb-81a0-9a62afc21cb0" -> (known after apply)
      ~ start_date            = "2023-10-19T07:06:10Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Common Platform Pre-Production"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "961aac0d-6eca-4dde-81b4-9b9e7d9fb99b"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["MoJ Common Platform Pre-Production"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c3d84f7175ff8f4ee0a90kv.vault.azure.net/secrets/sp-token/3a61d8975efb47258a0d1f4a20a590a5"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Production"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/41e782ba-d46d-46df-90ec-6987ec0f4923" -> (known after apply)
      ~ application_object_id = "41e782ba-d46d-46df-90ec-6987ec0f4923" -> "/applications/41e782ba-d46d-46df-90ec-6987ec0f4923" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-08-11T07:06:43Z" -> (known after apply)
      ~ id                    = "41e782ba-d46d-46df-90ec-6987ec0f4923/password/ea2056ec-c39f-48e5-9261-dabd41c56e22" -> (known after apply)
      ~ key_id                = "ea2056ec-c39f-48e5-9261-dabd41c56e22" -> (known after apply)
      ~ start_date            = "2023-08-11T07:06:43Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Common Platform Production"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "ecb45716-e030-4b08-b2a2-c8a3a0830e78"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["MoJ Common Platform Production"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c55c2f45ef85215b8bb4fkv.vault.azure.net/secrets/sp-token/befbb97b2091476e971969b9097abb84"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["MoJ Operational Services Validation"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/5fbd8366-2e28-4d7d-a0fb-bdb17d2c5f30" -> (known after apply)
      ~ application_object_id = "5fbd8366-2e28-4d7d-a0fb-bdb17d2c5f30" -> "/applications/5fbd8366-2e28-4d7d-a0fb-bdb17d2c5f30" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-08-11T07:06:43Z" -> (known after apply)
      ~ id                    = "5fbd8366-2e28-4d7d-a0fb-bdb17d2c5f30/password/42960e8a-cf4e-419f-9e6c-d7820481dbac" -> (known after apply)
      ~ key_id                = "42960e8a-cf4e-419f-9e6c-d7820481dbac" -> (known after apply)
      ~ start_date            = "2023-08-11T07:06:43Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Operational Services Validation"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "ad089132-0701-439f-a3be-8165716a1cd1"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["MoJ Operational Services Validation"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c6491a35d0b847abc9a1bkv.vault.azure.net/secrets/sp-token/1c03d5c893174ac29868fdcb814c0288"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["Reform-CFT-MI-SB"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/7e1f247a-6686-448b-8d63-9bcd2032b2ef" -> (known after apply)
      ~ application_object_id = "7e1f247a-6686-448b-8d63-9bcd2032b2ef" -> "/applications/7e1f247a-6686-448b-8d63-9bcd2032b2ef" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-08-11T07:06:43Z" -> (known after apply)
      ~ id                    = "7e1f247a-6686-448b-8d63-9bcd2032b2ef/password/aaa9321f-0c10-4228-8553-1b3afaed25c2" -> (known after apply)
      ~ key_id                = "aaa9321f-0c10-4228-8553-1b3afaed25c2" -> (known after apply)
      ~ start_date            = "2023-08-11T07:06:43Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["Reform-CFT-MI-SB"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "a8d2b8ba-d640-468c-ad7f-301bd423211c"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://cabe4bc04464f70ebc2cekv.vault.azure.net/secrets/sp-token/6bf3021cf3434484898b486aff98ab8b"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/7285fd5f-bd67-49d7-82d8-9d28815a9754" -> (known after apply)
      ~ application_object_id = "7285fd5f-bd67-49d7-82d8-9d28815a9754" -> "/applications/7285fd5f-bd67-49d7-82d8-9d28815a9754" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-25T07:09:52Z" -> (known after apply)
      ~ id                    = "7285fd5f-bd67-49d7-82d8-9d28815a9754/password/8c0be5dd-32c0-41c7-a2e8-7d7bba76b681" -> (known after apply)
      ~ key_id                = "8c0be5dd-32c0-41c7-a2e8-7d7bba76b681" -> (known after apply)
      ~ start_date            = "2023-07-25T07:09:52Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "4bb4430c-5b58-40f8-aa87-fd50925d5585"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://ced302caf85731c3ce90ekv.vault.azure.net/secrets/sp-token/951affa36e8943359bb8ce3f34507bd0"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/c17e7151-6d52-4cda-8110-fa3a954306bb" -> (known after apply)
      ~ application_object_id = "c17e7151-6d52-4cda-8110-fa3a954306bb" -> "/applications/c17e7151-6d52-4cda-8110-fa3a954306bb" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-25T07:09:47Z" -> (known after apply)
      ~ id                    = "c17e7151-6d52-4cda-8110-fa3a954306bb/password/35f8a639-ecf7-49a2-9a15-2931141ec66e" -> (known after apply)
      ~ key_id                = "35f8a639-ecf7-49a2-9a15-2931141ec66e" -> (known after apply)
      ~ start_date            = "2023-07-25T07:09:47Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "e4e73e66-33c1-4fcb-8693-893bc6080f49"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c705b273195f157f0a347kv.vault.azure.net/secrets/sp-token/6f85c6af61d2432b95d894da8d8f0b1c"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 75 to add, 141 to change, 75 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":99,"Program":"tfcmt","SHA1":"","Target":"prod_enterprise","Vars":{}} -->